<a href="https://colab.research.google.com/github/jayac251/Machine_Learning/blob/main/Pandas_7_Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Group By**

DataFrame.GROUP BY() function is used to split the data into groups based on some criteria.


Pandas objects like a DataFrame can be split on any of their axes. 
The GROUP BY function works based on a split-apply-combine strategy which is shown below using a 3-step process:

Step 1: Split the data into groups by creating a GROUP BY object from the original DataFrame.


Step 2: Apply the required function.


Step 3: Combine the results to form a new DataFrame.

In [ ]:
import pandas as pd


marksUT= {'Name':['Raman','Raman','Raman','Zuhaire','Zuhaire','Zuhaire', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
 'UT':[1,2,3,1,2,3,1,2,3,1,2,3],
 'Maths':[22,21,14,20,23,22,23,24,12,15,18,17],
 'Science':[21,20,19,17,15,18,19,22,25,22,21,18],
 'S.St':[18,17,15,22,21,19,20,24,19,25,25,20],
 'Hindi':[20,22,24,24,25,23,15,17,21,22,24,25],
 'Eng':[21,24,23,19,15,13,22,21,23,22,23,20]
 }

df=pd.DataFrame(marksUT)

print(df)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

In [ ]:
g1=df.groupby(by='UT')
g2=df.groupby('Name')

#Displaying the first entry from each group
g1.first()

     Name  Maths  Science  S.St  Hindi  Eng
UT
1   Raman     22       21    18     20   21
2   Raman     21       20    17     22   24
3   Raman     14       19    15     24   23

In [ ]:
#Displaying the size of each group
g1.size()

UT
1    4
2    4
3    4
dtype: int64

In [ ]:
#Displaying group data, i.e., group_name, row indexes corresponding to the group and their data type 
g1.groups

{1: [0, 3, 6, 9], 2: [1, 4, 7, 10], 3: [2, 5, 8, 11]}

In [ ]:
g1.get_group(3)

       Name  Maths  Science  S.St  Hindi  Eng
2     Raman     14       19    15     24   23
5   Zuhaire     22       18    19     23   13
8   Ashravy     12       25    19     21   23
11   Mishti     17       18    20     25   20

In [ ]:
g2.get_group('Raman')

    Name  UT  Maths  Science  S.St  Hindi  Eng
0  Raman   1     22       21    18     20   21
1  Raman   2     21       20    17     22   24
2  Raman   3     14       19    15     24   23

In [ ]:
#Grouping with respect to multiple attributes #Creating a GROUP BY Name and UT
g3=df.groupby(['Name', 'UT'])

g3.first()

g3.groups
print(g3.get_group(('Ashravy', 1)))
g3.get_group(('Ashravy', 1)).mean()

   Maths  Science  S.St  Hindi  Eng
6     23       19    20     15   22

Maths      23.0
Science    19.0
S.St       20.0
Hindi      15.0
Eng        22.0
dtype: float64

In [ ]:
for name,group in g3:
   print(name)
   print(group)

('Ashravy', 1)
      Name  UT  Maths  Science  S.St  Hindi  Eng
6  Ashravy   1     23       19    20     15   22
('Ashravy', 2)
      Name  UT  Maths  Science  S.St  Hindi  Eng
7  Ashravy   2     24       22    24     17   21
('Ashravy', 3)
      Name  UT  Maths  Science  S.St  Hindi  Eng
8  Ashravy   3     12       25    19     21   23
('Mishti', 1)
     Name  UT  Maths  Science  S.St  Hindi  Eng
9  Mishti   1     15       22    25     22   22
('Mishti', 2)
      Name  UT  Maths  Science  S.St  Hindi  Eng
10  Mishti   2     18       21    25     24   23
('Mishti', 3)
      Name  UT  Maths  Science  S.St  Hindi  Eng
11  Mishti   3     17       18    20     25   20
('Raman', 1)
    Name  UT  Maths  Science  S.St  Hindi  Eng
0  Raman   1     22       21    18     20   21
('Raman', 2)
    Name  UT  Maths  Science  S.St  Hindi  Eng
1  Raman   2     21       20    17     22   24
('Raman', 3)
    Name  UT  Maths  Science  S.St  Hindi  Eng
2  Raman   3     14       19    15     24   23
('Zuhaire', 1)
      Name  UT  Maths  Science  S.St  Hindi  Eng
3  Zuhaire   1     20       17    22     24   19
('Zuhaire', 2)
      Name  UT  Maths  Science  S.St  Hindi  Eng
4  Zuhaire   2     23       15    21     25   15
('Zuhaire', 3)
      Name  UT  Maths  Science  S.St  Hindi  Eng
5  Zuhaire   3     22       18    19     23   13

In [44]:
#Calculate average marks scored in Maths in each UT
group1=df.groupby(['UT'])
group1['Maths'].aggregate('mean')

UT
1    20.00
2    21.50
3    16.25
Name: Maths, dtype: float64

In [70]:
#Write the python statements to print the mean, variance, standard deviation and quartile of the marks scored in Mathematics by each student across the UTs.
print(df)
#maths = df[['Name','UT','Maths']]

group1 = df.groupby('Name')

group1['Maths'].agg(['mean','var','std','quantile'])

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

              mean        var       std  quantile
Name
Ashravy  19.666667  44.333333  6.658328      23.0
Mishti   16.666667   2.333333  1.527525      17.0
Raman    19.000000  19.000000  4.358899      21.0
Zuhaire  21.666667   2.333333  1.527525      22.0

In [4]:
import pandas as pd

student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

student_data

   school_code class            name  ... height  weight  address
S1        s001     V  Alberto Franco  ...    173      35  street1
S2        s002     V    Gino Mcneill  ...    192      32  street2
S3        s003    VI     Ryan Parkes  ...    186      33  street3
S4        s001    VI    Eesha Hinton  ...    167      30  street1
S5        s002     V    Gino Mcneill  ...    151      31  street2
S6        s004    VI    David Parkes  ...    159      32  street4

[6 rows x 8 columns]

In [6]:
# 1. Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object

schoolCodeGrp = student_data.groupby('school_code')

for name,group in schoolCodeGrp:
    print("\nGroup:")
    print(name)
    print(group)

Group:
s001
   school_code class            name  ... height  weight  address
S1        s001     V  Alberto Franco  ...    173      35  street1
S4        s001    VI    Eesha Hinton  ...    167      30  street1

[2 rows x 8 columns]

Group:
s002
   school_code class          name date_Of_Birth   age  height  weight  address
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31  street2

Group:
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group:
s004
   school_code class          name date_Of_Birth   age  height  weight  address
S6        s004    VI  David Parkes     15/09/1997   12     159      32  street4

In [12]:
# 2. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

student_data

schoolCodeGrp = student_data.groupby('school_code')

schoolCodeGrp['age'].aggregate(['mean','min','max'])

             mean  min  max
school_code
s001         12.5   12   13
s002         13.0   12   14
s003         13.0   13   13
s004         12.0   12   12

In [19]:
# 3. Write a Pandas program to split the following given dataframe into groups based on school code and class

student_data
schoolCodeGrpClass = student_data.groupby(['school_code','class'], sort=True)

for name,group in schoolCodeGrp:
    print("\nGroup:")
    print(name)
    print(group)

Group:
s001
   school_code class            name  ... height  weight  address
S1        s001     V  Alberto Franco  ...    173      35  street1
S4        s001    VI    Eesha Hinton  ...    167      30  street1

[2 rows x 8 columns]

Group:
s002
   school_code class          name date_Of_Birth   age  height  weight  address
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31  street2

Group:
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group:
s004
   school_code class          name date_Of_Birth   age  height  weight  address
S6        s004    VI  David Parkes     15/09/1997   12     159      32  street4

In [20]:
# Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list

schoolCodeGrpClass = student_data.groupby(['school_code'])

print(list(schoolCodeGrpClass))

[('s001',    school_code class            name  ... height  weight  address
S1        s001     V  Alberto Franco  ...    173      35  street1
S4        s001    VI    Eesha Hinton  ...    167      30  street1

[2 rows x 8 columns]), ('s002',    school_code class          name date_Of_Birth   age  height  weight  address
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31  street2), ('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), ('s004',    school_code class          name date_Of_Birth   age  height  weight  address
S6        s004    VI  David Parkes     15/09/1997   12     159      32  street4)]

In [23]:
# 5. Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data

schoolCodeGrpClass = student_data.groupby(['school_code'])

print(schoolCodeGrpClass.size())

schoolCodeGrpClass = student_data.groupby(['school_code','class'])

print(schoolCodeGrpClass.size())

school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64
school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

In [25]:
#Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group
student_data
schoolCodeGrp = student_data.groupby(['school_code'])

schoolCodeGrp.get_group('s003')

   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

In [27]:
import pandas as pd
#pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [29]:
# 7. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. 
# Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).
orders_data

grpByCustIdgrp = orders_data.groupby('customer_id')

grpByCustIdgrp['purch_amt'].aggregate(['mean','min','max'])

                    mean      min      max
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333    65.26  5760.00
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000   110.50  2480.40

In [63]:
# 8. Write a Pandas program to split a dataset to group by two columns and count by each row

#orders_data
grpByCustIdgrp = orders_data.groupby(['customer_id','salesman_id'])

print(grpByCustIdgrp.count())

result = orders_data.groupby(['customer_id','salesman_id']).size().reset_index().groupby(['customer_id','salesman_id'])[[0]].max()

r = grpByCustIdgrp.size().reset_index()

r.groupby(['customer_id','salesman_id'])[[0]].max()

                         ord_no  purch_amt  ord_date
customer_id salesman_id
3001        5005              1          1         1
3002        5001              3          3         3
3003        5007              1          1         1
3004        5006              1          1         1
3005        5002              2          2         2
3007        5001              1          1         1
3008        5002              1          1         1
3009        5003              2          2         2

                         0
customer_id salesman_id
3001        5005         1
3002        5001         3
3003        5007         1
3004        5006         1
3005        5002         2
3007        5001         1
3008        5002         1
3009        5003         2

In [106]:
#orders_data
grpByCustIdgrp = orders_data.groupby(['customer_id','salesman_id'])
r = grpByCustIdgrp.agg({'purch_amt':sum})
result = r['purch_amt'].groupby(level=0, group_keys=False)
result.nlargest()

#r['sum'] = grpByCustIdgrp[['sum']].transform(sum)

customer_id  salesman_id
3001         5005            270.65
3002         5001           8870.86
3003         5007             75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002            250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

In [108]:
# 9. Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups. 
# In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.


df_agg = orders_data.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum})
result = df_agg['purch_amt'].groupby(level=0, group_keys=False)
print("\nGroup on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups:")
print(result.nlargest())

Group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups:
customer_id  salesman_id
3001         5005            270.65
3002         5001           8870.86
3003         5007             75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002            250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

In [122]:
# 10. Write a Pandas program to split the following dataframe into groups based on customer id and create a list of order date for each group.

df = orders_data.groupby(['customer_id'])

result = df['ord_date'].apply(list)

In [133]:
# Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount.

print(orders_data)
orders_data['ord_date'] = pd.to_datetime(orders_data['ord_date'])

#month wise purchase amount
result = orders_data.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
result


#orders_data['ord_date']= orders_data.to_datetime(orders_data['ord_date']) 
#print("\nMonth wise purchase amount:")
#result = df.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})

#df.first()

    ord_no  purch_amt   ord_date  customer_id  salesman_id
0    70001     150.50 2012-10-05         3005         5002
1    70009     270.65 2012-09-10         3001         5005
2    70002      65.26 2012-10-05         3002         5001
3    70004     110.50 2012-08-17         3009         5003
4    70007     948.50 2012-09-10         3005         5002
5    70005    2400.60 2012-07-27         3007         5001
6    70008    5760.00 2012-09-10         3002         5001
7    70010    1983.43 2012-10-10         3004         5006
8    70003    2480.40 2012-10-10         3009         5003
9    70012     250.45 2012-06-27         3008         5002
10   70011      75.29 2012-08-17         3003         5007
11   70013    3045.60 2012-04-25         3002         5001

            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59

In [134]:
# 12. Write a Pandas program to split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise

print(orders_data)
orders_data['ord_date'] = pd.to_datetime(orders_data['ord_date'])

#month wise purchase amount
result = orders_data.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
result

print("\nYear wise Month wise purchase amount:")
result = orders_data.groupby([orders_data['ord_date'].dt.year, orders_data['ord_date'].dt.month]).agg({'purch_amt':sum})
print(result)

    ord_no  purch_amt   ord_date  customer_id  salesman_id
0    70001     150.50 2012-10-05         3005         5002
1    70009     270.65 2012-09-10         3001         5005
2    70002      65.26 2012-10-05         3002         5001
3    70004     110.50 2012-08-17         3009         5003
4    70007     948.50 2012-09-10         3005         5002
5    70005    2400.60 2012-07-27         3007         5001
6    70008    5760.00 2012-09-10         3002         5001
7    70010    1983.43 2012-10-10         3004         5006
8    70003    2480.40 2012-10-10         3009         5003
9    70012     250.45 2012-06-27         3008         5002
10   70011      75.29 2012-08-17         3003         5007
11   70013    3045.60 2012-04-25         3002         5001

Year wise Month wise purchase amount:
                   purch_amt
ord_date ord_date
2012     4           3045.60
         6            250.45
         7           2400.60
         8            185.79
         9           6979.15
         10          4679.59

In [157]:
# 13. Write a Pandas program to split the following dataframe into groups based on first column and set other column values into a list of values.

df = pd.DataFrame( {'X' : [10, 10, 10, 20, 30, 30, 10], 
                    'Y' : [10, 15, 11, 20, 12, 12, 14], 
                    'Z' : [22, 20, 18, 20, 13, 10, 0]})

        

#result= df.groupby('X').agg(lambda tdf: tdf.unique().tolist())

#result

#df['X'].unique().tolist()

result= df.groupby('X').agg(lambda x: x.unique().tolist())
#result.get_group(10)
print(result)


result= df.groupby('X').agg(lambda x: x.tolist())
print(result)

                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30              [12]         [13, 10]
                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30          [12, 12]         [13, 10]

In [163]:
#Write a Pandas program to split the following dataframe into groups based on all columns and calculate GroupBy value counts on the dataframe.

df = pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2], 
                    'type' : [10, 15, 11, 20, 21, 12, 14], 
                    'book' : ['Math','English','Physics','Math','English','Physics','English']})

result= df.groupby(['id','type','book']).size().unstack(fill_value=0)
result

book     English  Math  Physics
id type
1  10          0     1        0
   11          0     0        1
   12          0     0        1
   20          0     1        0
2  14          1     0        0
   15          1     0        0
   21          1     0        0